ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV230/WordFiboClockV230.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino. ...
 Changes V094: Replaced NIMBLE with ESP32 BLE.  ...
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000. ...
 Changes V199: All Rework in Webpage to CheckWIFIcommand(). 199a Clock logic in ClockLogic.h. Corrected double Menu i and ii on webpage when BLE open.   ...
 Changes V228: Check all clock definitions and corrected error. Added ClearTestStrip().    
 Changes V229: New Name WordFiboClock. Combined WordclockV228 and FibonacciV011. The HC-12 / BLE TimeSender is a new feature (H06). 
 Changes V230: Added Fibo colourpicker. Combined headers. Error with Neopixel wrong pinnumbering .     
        
*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy)      -- > When using NEOpixel   Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' when using By Arduino pin
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock variant

*/
// =============================================================================================================================
// ------------------>   Define only ONE display type below.

//   FIBONACCI selects the Fibonacci clock; any other selection is a word clock.

#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define UK144CLOCK              // English display for 12 x 12 Front.
//#define FR144CLOCK              // French display for 12 x 12 Front.
//#define DE144CLOCK              // German display for 12 x 12 Front.
//#define NL92CLOCK               // Dutch display for one LED-strip behind every word
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L294          // NL clock with four extra LEDs for the minutes to light up
//#define VIERTALENKLOK           // Viertalenklok Ulrich
//#define FIBONACCI               // Fibonacci / chrono clock

// ------------------>   Derive the build variant from the selection above

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// The ONEWIRE's are a nice to have options. I leave them as a define for sometimes use
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//-------------------------------------------
             #if !defined(FIBONACCI)
#define WORDCLOCK                                                                             // Any non-Fibonacci selection is a word clock (uses WordClock.h / ClockFaces.h)
             #endif
             #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (3, 3, 0)                     // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED  // Use EdsoftLED >= V1.9.0 for SK6812. Saves 200-500 bytes compared with NeoPixel. To use NeoPixel is also OK but compile: By GPIO number (legacy)
             #endif
             #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
             #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  *** USE GPIO NUMBERING and compile By GPIO number (legacy) 
             #endif
//------------------------------------------------------------------------------              //
// Build-environment sanity check - stop the build on an easy-to-miss IDE setting
//--------------------------------------------
             #if !defined(USEEDSOFTLED) && defined(BOARD_HAS_PIN_REMAP)                       // NeoPixel + Tools > Pin Numbering = 'By Arduino pin'
  #error "NeoPixel build with 'Pin Numbering = By Arduino pin'. Set Tools > Pin Numbering to 'By GPIO number (legacy)' (and use GPIO numbers, e.g. LED_PIN = 8) to avoid the 'undefined reference to digitalPinToGPIONumber' link error."
             #endif

#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <esp_sntp.h>          // for NTP
#include <esp_wps.h>           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/ESP32Async 
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 
#include <IRremote.hpp>        // IR remote control

// CLOCK_VARIANT (build name string) is defined per-variant in WordClock.h / Fibonacci.h
//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

