ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV230/WordFiboClockV230.ino
//------------------------------------------------------------------------------              //
// COLOURS stored in Mem.DisplayChoice
//--------------------------------------------   

const byte DEFAULTCOLOUR = 0;                                                                 // Generic default (used by Reset - shared)

//------------------------------------------------------------------------------              //
// PIN Assigments for Arduino Nano ESP32
// Use GPIO numbering when compiling with:  By GPIO number (legacy).
//------------------------------------------------------------------------------ 
 
enum DigitalPinAssignments {      // Digital hardware constants ATMEGA 328 ----
 SERRX        = D0,               // Connects to Bluetooth TX
 SERTX        = D1,               // Connects to Bluetooth RX
 encoderPinB  = D2, //5,          // D2 left (labeled CLK on decoder) *** D8 on large PCB !!! no interrupt pin (Use GPIO pin numbering for rotary encoder lib)  
 encoderPinA  = D3, //6,          // D3 right (labeled DT on decoder) on interrupt pin
 clearButton  = D4, //7,          // D4 switch (labeled SW on decoder)
 IRReceiverPin= D4,               // D4 Infrared receiver pin instead of rotary encoder
 HC12_TX      = D4,               // D4 HC-12 433MHz time sender (TX only). Shares D4 with the IR receiver - cannot use both at once
 LED_PIN      = D5, //8,          // D5 / GPIO 8 Pin to control colour SK6812/WS2812 LEDs (replace D5 with 8 for NeoPixel lib)
 RST_PIN      = 0,                // if 0 then not used D2 / GPIO 5 or D6 Reset pin. Stored in Mem.ResetPin. After reset Mem.ResetPin = RST_PIN
 EmptyD6      = D6,               // D6 / GPIO 9 Empty
 EmptyD7      = D7,               // D7 / GPIO 10 Empty
 encoderPinBL = D8,               // D8 *** If large PCB is used change pin D2 to D8 !!
 PCB_LED_D09  = D9,               // D9
 PCB_LED_D10  = D10,              // D10
 EmptyD11     = D11,              // D11 
 COLPIND12    = D12,              // D12 Used as dummy with KEYPAD
 secondsPin   = D13 //48,         // D13  GPIO48 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 };

enum AnaloguePinAssignments {     // Analogue hardware constants ----
 EmptyA0      = A0,               // Empty
 EmptyA1      = A1,               // Empty
 PhotoCellPin = A2,               // LDR pin
 OneWirePin   = A3,               // OneWirePin
 SDA_pin      = A4,               // SDA pin
 SCL_pin      = A5,               // SCL pin
 EmptyA6      = A6,               // Empty
 EmptyA7      = A7};              // Empty
 //------------------------------------------------------------------------------              //
// Common
//----------------------------------------
char      sptext[255];                                                                        // For common print use 
bool      LEDsAreOff        = false;                                                          // If true LEDs are off except time display
bool      NoTextInLeds      = false;                                                          // Flag to control printing of the text in function ColorLeds()
int       Previous_LDR_read = 512;                                                            // The actual reading from the LDR + 4x this value /5
uint16_t  MilliSecondValue  = 10;                                                             // The duration of a second  minus 1 ms. Used in Demo mode
uint32_t  Loopcounter       = 100;                                                            // ESP will restart if <10. so start with a larger start value
static const uint32_t MCURESTART_RESET_AFTER_MS = 120000;                                     // 2 minutes
static bool mcuRestartCounterCleared = false;

struct    EEPROMstorage {                                                                     // Data storage in EEPROM to maintain them after power loss
  byte DisplayChoice    = 0;
  byte TurnOffLEDsAtHH  = 0;
  byte TurnOnLEDsAtHH   = 0;
  byte LanguageChoice   = 0;
  byte LightReducer     = 50;
  int  LowerBrightness  = 0;
  int  UpperBrightness  = 255;                                                                // 
  int  NVRAMmem[24];                                                                          // LDR or other readings
  byte BLEOn            = 1;                                                                  // BLE On/Off
  byte NTPOn            = 1;                                                                  // NTP On/Off
  byte WIFIOn           = 1;                                                                  // WIFI  On/Off  
  byte StatusLEDOn      = 1;                                                                  // Status LEDs on board  On/Off
  byte MCUrestarted     = 0;                                                                  // No of times WIFI reconnected 
  byte LoopRebooted     = 0;                                                                  // No of times WIFI rebooted
  byte TimeReceiver     = 0;                                                                  // Use Time Sender app to set time 
  byte TimeLogPrint     = 0;                                                                  // Print time per minute (1) or hour (2)  
  byte DCF77On          = 0;                                                                  // Not used 
  byte TimeInput        = 0;                                                                  // Use coding for Rotary encoder ==1 or 3x1 membrane keypad ==2
  byte UseDS3231        = 0;                                                                  // Use the DS3231 time module 
  byte LEDstrip         = 0;                                                                  // 0 = SK6812 LED strip. 1 = WS2812 LED strip
  byte FiboChrono       = 0;                                                                  // true = Fibonacci, false = chrono clock display
  byte NoExUl           = 0;                                                                  // 0 = Normal, 1 = Extreme, 2 = Ultimate display of colours
  byte WIFIcredentials  = 0;                                                                  // Status of the WIFI connection. SSID&PWD set or in AP mode
  byte byteFuture1      = 0;                                                                  // Use Reset pin
  byte byteFuture2      = 0;                                                                  // For future use
  byte byteFuture3      = 0;                                                                  // For future use
  int  IntFuture2       = 0;                                                                  // For future use
  byte TimeSender       = 0;                                                                  // Turn this device on as time sender Code in ESP32Communications.ino sketch
  byte Ringbufcnt       = 0;                                                                  // Ringbuffer counter ON or OFF
  byte HC12Time         = 0;                                                                  // Use HC12 timesender
  byte ResetPin         = 0;                                                                  // Use Resetpin on GPIO number
  byte HetIsWasOff      = 0;                                                                  // Turn On or Off HET IS WAS   
  byte EdSoftLEDSOn     = 0;                                                                  // EdSoft text on/off   
  byte RandomDisplay    = 0;                                                                  // Choose every minute/hour another display 
  byte WIFInoConnection = 0;                                                                  // Will store the no of reboots   
  byte UseBLELongString = 0;                                                                  // Send strings longer than 20 bytes per message. Possible in IOS app BLEserial Pro 
  uint32_t OwnColour    = 0;                                                                  // Self defined colour for clock display
  uint32_t DimmedLetter = 0;
  uint32_t BackGround   = 0;
  char SSID[30];                                                                              // 
  char Password[40];                                                                          // 
  char BLEbroadcastName[30];                                                                  // Name of the BLE beacon
  char Timezone[50];
  int  Checksum         = 0;
  uint32_t ColourNL     = 0;                                                                  // Self defined NL colour for clock display
  uint32_t ColourUK     = 0;                                                                  // Self defined UK colour for clock display
  uint32_t ColourDE     = 0;                                                                  // Self defined DE colour for clock display
  uint32_t ColourFR     = 0;                                                                  // Self defined FR colour for clock display  
  int  IntFuture6       = 0;                                                                  // For future use
  int  IntFuture7       = 0;                                                                  // For future use
  int  IntFuture8       = 0;                                                                  // For future use
  int  IntFuture9       = 0;                                                                  // For future use
  uint32_t Extra1       = 0;
  uint32_t Extra2       = 0;
  char ExtraSpace[50]   = "";        
}  Mem; 
    
