ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV230/WordFiboClockV230.ino
 memcpy(HTML_page + i, index_html_top,    topLen);     i += topLen;
 memcpy(HTML_page + i, html_info,         infoLen);    i += infoLen;
 memcpy(HTML_page + i, index_html_footer, footerLen);  i += footerLen;
 HTML_page[i] = 0;
}

//--------------------------------------------                                                //
// WIFI CheckWIFIcommand
//--------------------------------------------
void CheckWIFIcommand(void)
{
 if (PendingCommand.length() > 0)
  {
   ReworkInputString(PendingCommand);
   BuildHTMLPage(false);                                                                      // Rebuild page after command; no logging (only i/ii should log the menu) 
  }
}
//--------------------------------------------                                                //
// WIFI WEBPAGE
//--------------------------------------------
void WebPage(void)
{
 BuildHTMLPage(true);                                                                         // Build initial page at startup with logging enabled
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);                                       // LOGBUFFER Printlast 500 lines
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);                                  // LOGBUFFER Stream all the circular log buffer directly to the client
#if defined(WORDCLOCK) || defined(FIBONACCI)
 server.on("/colourpick", HTTP_GET, [](AsyncWebServerRequest *request)
  {
  String page = ColourPick_html;
  char buf[12];
  page.replace("%%CNAME%%", Mem.BLEbroadcastName);                                            // Page title = broadcast name
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourNL);     page.replace("%%COLNL%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourDE);     page.replace("%%COLDE%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourFR);     page.replace("%%COLFR%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourUK);     page.replace("%%COLUK%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.DimmedLetter); page.replace("%%COLBG%%", buf);
  request->send(200, "text/html", page);
  });
#endif   // colour picker (WordClock + Fibonacci)
 server.on("/menu", HTTP_GET, [](AsyncWebServerRequest *request)                              // Serve the settings menu page
   {  request->send(200, "text/html", menu_html);  });

 server.on("/menustate", HTTP_GET, [](AsyncWebServerRequest *request)                         // Return current Mem toggle states as JSON
  {
   char json[512];
#if defined(FIBONACCI)
   snprintf(json, sizeof(json),
     "{\"tf\":%d,\"t2\":%d,\"t3\":%d,\"t5\":%d,\"t8\":%d,\"tj\":%d,\"t9\":%d,"
     "\"hi\":\"h0%d\",\"qval\":%d,\"sval\":%d,\"lval\":%d,\"mval\":%d,"
     "\"noff\":%d,\"non\":%d,\"ds3231hw\":%d,\"rtcsrc\":\"%s\",\"kldr\":%d,\"kmin\":%d,\"khour\":%d,\"koff\":%d,\"cname\":\"%s\"}",
     Mem.FiboChrono   ? 1 : 0,  // tf F  Fibonacci display
     LEDsAreOff       ? 0 : 1,  // t2 O
     Mem.StatusLEDOn  ? 1 : 0,  // t3 P
     Mem.NTPOn        ? 1 : 0,  // t5 X
     Mem.Ringbufcnt   ? 1 : 0,  // t8 }
     Mem.UseDS3231    ? 1 : 0,  // tj J
     Mem.TimeReceiver ? 1 : 0,  // t9 H05
     (int)Mem.TimeInput,        // hi h00-h04
     (int)Mem.DisplayChoice,    // qval Q0-Q9
     (int)Mem.LightReducer,     // sval S
     (int)Mem.LowerBrightness,  // lval L
     (int)Mem.UpperBrightness,  // mval M
     (int)Mem.TurnOffLEDsAtHH,  // noff N off-hour
     (int)Mem.TurnOnLEDsAtHH,   // non  N on-hour
     DS3231Installed  ? 1 : 0,  // ds3231hw
     (Mem.UseDS3231 && DS3231Installed) ? "DS3231" : (Mem.NTPOn ? "NTP" : "ESP32"),
     TestLDR              ? 1 : 0,  // kldr K  (LDR test)
     Mem.TimeLogPrint==1  ? 1 : 0,  // kmin K1 (log per minute)
     Mem.TimeLogPrint==2  ? 1 : 0,  // khour K2 (log per hour)
     Mem.TimeLogPrint==0  ? 1 : 0,  // koff K0 (logging off)
     Mem.BLEbroadcastName);         // cname shown as page title
#else   // WORDCLOCK
   snprintf(json, sizeof(json),
     "{\"t0\":%d,\"t1\":%d,\"t2\":%d,\"t3\":%d,\"t5\":%d,\"t8\":%d,"
     "\"tj\":%d,\"tself\":%d,\"tdemo\":%d,\"t9\":%d,"
     "\"hi\":\"h0%d\",\"qval\":%d,"
     "\"sval\":%d,\"lval\":%d,\"mval\":%d,"
     "\"noff\":%d,\"non\":%d,"
     "\"ds3231hw\":%d,\"rtcsrc\":\"%s\",\"kldr\":%d,\"kmin\":%d,\"khour\":%d,\"koff\":%d,\"cname\":\"%s\"}",
     Mem.HetIsWasOff      ? 0 : 1,  // t0 )  HET IS WAS ON when HetIsWasOff==0
     Mem.EdSoftLEDSOn     ? 1 : 0,  // t1 (
     LEDsAreOff           ? 0 : 1,  // t2 O  ON when display is on
     Mem.StatusLEDOn      ? 1 : 0,  // t3 P
     Mem.NTPOn            ? 1 : 0,  // t5 X
     Mem.Ringbufcnt       ? 1 : 0,  // t8 }
     Mem.UseDS3231        ? 1 : 0,  // tj J
     Zelftest             ? 1 : 0,  // tself #
     Demo                 ? 1 : 0,  // tdemo U
     Mem.TimeReceiver     ? 1 : 0,  // t9 H05
     (int)Mem.TimeInput,            // hi  h00-h04
     (int)Mem.DisplayChoice,        // qval Q0-Q8
     (int)Mem.LightReducer,         // sval S
     (int)Mem.LowerBrightness,      // lval L
     (int)Mem.UpperBrightness,      // mval M
     (int)Mem.TurnOffLEDsAtHH,      // noff N off-hour
     (int)Mem.TurnOnLEDsAtHH,       // non  N on-hour
     DS3231Installed      ? 1 : 0,  // ds3231hw hardware present
     (Mem.UseDS3231 && DS3231Installed) ? "DS3231" :
       (Mem.NTPOn ? "NTP" : "ESP32"), // rtcsrc active time source
     TestLDR              ? 1 : 0,  // kldr K  (LDR test)
     Mem.TimeLogPrint==1  ? 1 : 0,  // kmin K1 (log per minute)
     Mem.TimeLogPrint==2  ? 1 : 0,  // khour K2 (log per hour)
     Mem.TimeLogPrint==0  ? 1 : 0,  // koff K0 (logging off)
     Mem.BLEbroadcastName           // cname shown as page title
   );
#endif
   request->send(200, "application/json", json);
  });

 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)
   {
    String inputMessage;
    if (request->hasParam(PARAM_INPUT_1)) {inputMessage = request->getParam(PARAM_INPUT_1)->value();}
    PendingCommand = inputMessage;                                                            //  Command → queue it and redirect
    request->redirect("/wait");
});

